balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ12MC201.PIC
        <edc:SFRDef edc:access="-----nnn-nnn-nnn" edc:cname="PWM1CON1" edc:desc="" edc:impl="0x777" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00011111111" edc:name="PWM1CON1" edc:nzwidth="0x10" edc:por="-----00011111111">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWMCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEN1L" edc:desc="" edc:mask="0x1" edc:name="PEN1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2L" edc:desc="" edc:mask="0x1" edc:name="PWN2L" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PEN1H" edc:desc="" edc:mask="0x1" edc:name="PEN1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEN2H" edc:desc="" edc:mask="0x1" edc:name="PEN2H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PMOD1" edc:desc="" edc:mask="0x1" edc:name="PMOD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMOD2" edc:desc="" edc:mask="0x1" edc:name="PMOD2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn-----nnn" edc:cname="PWM1CON2" edc:desc="" edc:impl="0xf07" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000-----000" edc:name="PWM1CON2" edc:nzwidth="0x10" edc:por="----0000-----000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PWMCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UDIS" edc:desc="" edc:mask="0x1" edc:name="UDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSYNC" edc:desc="" edc:mask="0x1" edc:name="OSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IUE" edc:desc="" edc:mask="0x1" edc:name="IUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SEVOPS" edc:desc="" edc:mask="0xf" edc:name="SEVOPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="SEVOPS0" edc:desc="" edc:mask="0x1" edc:name="SEVOPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS1" edc:desc="" edc:mask="0x1" edc:name="SEVOPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS2" edc:desc="" edc:mask="0x1" edc:name="SEVOPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEVOPS3" edc:desc="" edc:mask="0x1" edc:name="SEVOPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P1DTCON1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P1DTCON1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="DTCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTA" edc:desc="" edc:mask="0x3f" edc:name="DTA" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTAPS" edc:desc="" edc:mask="0x3" edc:name="DTAPS" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DTB" edc:desc="" edc:mask="0x3f" edc:name="DTB" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="DTBPS" edc:desc="" edc:mask="0x3" edc:name="DTBPS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DTA0" edc:desc="" edc:mask="0x1" edc:name="DTA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA1" edc:desc="" edc:mask="0x1" edc:name="DTA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA2" edc:desc="" edc:mask="0x1" edc:name="DTA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA3" edc:desc="" edc:mask="0x1" edc:name="DTA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA4" edc:desc="" edc:mask="0x1" edc:name="DTA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTA5" edc:desc="" edc:mask="0x1" edc:name="DTA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS0" edc:desc="" edc:mask="0x1" edc:name="DTAPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTAPS1" edc:desc="" edc:mask="0x1" edc:name="DTAPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB0" edc:desc="" edc:mask="0x1" edc:name="DTB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB1" edc:desc="" edc:mask="0x1" edc:name="DTB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB2" edc:desc="" edc:mask="0x1" edc:name="DTB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB3" edc:desc="" edc:mask="0x1" edc:name="DTB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB4" edc:desc="" edc:mask="0x1" edc:name="DTB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTB5" edc:desc="" edc:mask="0x1" edc:name="DTB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS0" edc:desc="" edc:mask="0x1" edc:name="DTBPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DTBPS1" edc:desc="" edc:mask="0x1" edc:name="DTBPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------------nnnn" edc:cname="P1DTCON2" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="P1DTCON2" edc:nzwidth="0x10" edc:por="------------0000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="DTCON2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DTS1I" edc:desc="" edc:mask="0x1" edc:name="DTS1I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS1A" edc:desc="" edc:mask="0x1" edc:name="DTS1A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2I" edc:desc="" edc:mask="0x1" edc:name="DTS2I" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTS2A" edc:desc="" edc:mask="0x1" edc:name="DTS2A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnn-----nn" edc:cname="P1FLTACON" edc:desc="" edc:impl="0x3f87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0000000----000" edc:name="P1FLTACON" edc:nzwidth="0x10" edc:por="----00000-----00">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="FLTACON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FAEN1" edc:desc="" edc:mask="0x1" edc:name="FAEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAEN2" edc:desc="" edc:mask="0x1" edc:name="FAEN2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="FLTAM" edc:desc="" edc:mask="0x1" edc:name="FLTAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1L" edc:desc="" edc:mask="0x1" edc:name="FAOV1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV1H" edc:desc="" edc:mask="0x1" edc:name="FAOV1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2L" edc:desc="" edc:mask="0x1" edc:name="FAOV2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FAOV2H" edc:desc="" edc:mask="0x1" edc:name="FAOV2H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----nnnn----nnnn" edc:cname="P1OVDCON" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--000000" edc:name="P1OVDCON" edc:nzwidth="0x10" edc:por="----1111----0000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="OVDCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POUT1L" edc:desc="" edc:mask="0x1" edc:name="POUT1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT1H" edc:desc="" edc:mask="0x1" edc:name="POUT1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2L" edc:desc="" edc:mask="0x1" edc:name="POUT2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POUT2H" edc:desc="" edc:mask="0x1" edc:name="POUT2H" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POVD1L" edc:desc="" edc:mask="0x1" edc:name="POVD1L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD1H" edc:desc="" edc:mask="0x1" edc:name="POVD1H" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2L" edc:desc="" edc:mask="0x1" edc:name="POVD2L" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVD2H" edc:desc="" edc:mask="0x1" edc:name="POVD2H" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P1DC1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P1DC1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PDC1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMDC1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PWMDC1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="P1DC2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="P1DC2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="PDC2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWMDC2" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PWMDC2" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnrnnnnnnnnnnnn" edc:cname="QEICON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="QEICON" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList>
            <edc:MigrationAlias edc:cname="QEI1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="UPDN_SRC" edc:desc="" edc:mask="0x1" edc:name="UPDN_SRC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCS" edc:desc="" edc:mask="0x1" edc:name="TQCS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POSRES" edc:desc="" edc:mask="0x1" edc:name="POSRES" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS" edc:desc="" edc:mask="0x3" edc:name="TQCKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TQGATE" edc:desc="" edc:mask="0x1" edc:name="TQGATE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCDOUT" edc:desc="" edc:mask="0x1" edc:name="PCDOUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWPAB" edc:desc="" edc:mask="0x1" edc:name="SWPAB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEIM" edc:desc="" edc:mask="0x7" edc:name="QEIM" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="UPDN" edc:desc="" edc:mask="0x1" edc:name="UPDN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INDX" edc:desc="" edc:mask="0x1" edc:name="INDX" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEISIDL" edc:desc="" edc:mask="0x1" edc:name="QEISIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CNTERR" edc:desc="" edc:mask="0x1" edc:name="CNTERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="TQCKPS0" edc:desc="" edc:mask="0x1" edc:name="TQCKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TQCKPS1" edc:desc="" edc:mask="0x1" edc:name="TQCKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEIM0" edc:desc="" edc:mask="0x1" edc:name="QEIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIM1" edc:desc="" edc:mask="0x1" edc:name="QEIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEIM2" edc:desc="" edc:mask="0x1" edc:name="QEIM2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="QEI" edc:pos="0xe"/>
        </edc:SFRDef>
