balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ12MC201.PIC
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR11" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR11" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCFAR" edc:desc="" edc:mask="0x1f" edc:name="OCFAR" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OCFAR0" edc:desc="" edc:mask="0x1" edc:name="OCFAR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR1" edc:desc="" edc:mask="0x1" edc:name="OCFAR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR2" edc:desc="" edc:mask="0x1" edc:name="OCFAR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR3" edc:desc="" edc:mask="0x1" edc:name="OCFAR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OCFAR4" edc:desc="" edc:mask="0x1" edc:name="OCFAR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR12" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR12" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTA1R" edc:desc="" edc:mask="0x1f" edc:name="FLTA1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTA1R0" edc:desc="" edc:mask="0x1" edc:name="FLTA1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R1" edc:desc="" edc:mask="0x1" edc:name="FLTA1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R2" edc:desc="" edc:mask="0x1" edc:name="FLTA1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R3" edc:desc="" edc:mask="0x1" edc:name="FLTA1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA1R4" edc:desc="" edc:mask="0x1" edc:name="FLTA1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR13" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR13" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLTA2R" edc:desc="" edc:mask="0x1f" edc:name="FLTA2R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLTA2R0" edc:desc="" edc:mask="0x1" edc:name="FLTA2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R1" edc:desc="" edc:mask="0x1" edc:name="FLTA2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R2" edc:desc="" edc:mask="0x1" edc:name="FLTA2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R3" edc:desc="" edc:mask="0x1" edc:name="FLTA2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTA2R4" edc:desc="" edc:mask="0x1" edc:name="FLTA2R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR14" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR14" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="QEA1R" edc:desc="" edc:mask="0x1f" edc:name="QEA1R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R" edc:desc="" edc:mask="0x1f" edc:name="QEB1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="QEA1R0" edc:desc="" edc:mask="0x1" edc:name="QEA1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R1" edc:desc="" edc:mask="0x1" edc:name="QEA1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R2" edc:desc="" edc:mask="0x1" edc:name="QEA1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R3" edc:desc="" edc:mask="0x1" edc:name="QEA1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEA1R4" edc:desc="" edc:mask="0x1" edc:name="QEA1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="QEB1R0" edc:desc="" edc:mask="0x1" edc:name="QEB1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R1" edc:desc="" edc:mask="0x1" edc:name="QEB1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R2" edc:desc="" edc:mask="0x1" edc:name="QEB1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R3" edc:desc="" edc:mask="0x1" edc:name="QEB1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="QEB1R4" edc:desc="" edc:mask="0x1" edc:name="QEB1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR15" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR15" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDX1R" edc:desc="" edc:mask="0x1f" edc:name="INDX1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INDX1R0" edc:desc="" edc:mask="0x1" edc:name="INDX1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R1" edc:desc="" edc:mask="0x1" edc:name="INDX1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R2" edc:desc="" edc:mask="0x1" edc:name="INDX1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R3" edc:desc="" edc:mask="0x1" edc:name="INDX1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INDX1R4" edc:desc="" edc:mask="0x1" edc:name="INDX1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR18" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR18" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXR" edc:desc="" edc:mask="0x1f" edc:name="U1RXR" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR" edc:desc="" edc:mask="0x1f" edc:name="U1CTSR" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXR0" edc:desc="" edc:mask="0x1" edc:name="U1RXR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR1" edc:desc="" edc:mask="0x1" edc:name="U1RXR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR2" edc:desc="" edc:mask="0x1" edc:name="U1RXR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR3" edc:desc="" edc:mask="0x1" edc:name="U1RXR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXR4" edc:desc="" edc:mask="0x1" edc:name="U1RXR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1CTSR0" edc:desc="" edc:mask="0x1" edc:name="U1CTSR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR1" edc:desc="" edc:mask="0x1" edc:name="U1CTSR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR2" edc:desc="" edc:mask="0x1" edc:name="U1CTSR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR3" edc:desc="" edc:mask="0x1" edc:name="U1CTSR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CTSR4" edc:desc="" edc:mask="0x1" edc:name="U1CTSR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPINR20" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---11111---11111" edc:name="RPINR20" edc:nzwidth="0x10" edc:por="---11111---11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0x1f" edc:name="SDI1R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK1R" edc:desc="" edc:mask="0x1f" edc:name="SCK1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SDI1R0" edc:desc="" edc:mask="0x1" edc:name="SDI1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R1" edc:desc="" edc:mask="0x1" edc:name="SDI1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R2" edc:desc="" edc:mask="0x1" edc:name="SDI1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R3" edc:desc="" edc:mask="0x1" edc:name="SDI1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDI1R4" edc:desc="" edc:mask="0x1" edc:name="SDI1R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="SCK1R0" edc:desc="" edc:mask="0x1" edc:name="SCK1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R1" edc:desc="" edc:mask="0x1" edc:name="SCK1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R2" edc:desc="" edc:mask="0x1" edc:name="SCK1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R3" edc:desc="" edc:mask="0x1" edc:name="SCK1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCK1R4" edc:desc="" edc:mask="0x1" edc:name="SCK1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPINR21" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------11111" edc:name="RPINR21" edc:nzwidth="0x10" edc:por="-----------11111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0x1f" edc:name="SS1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SS1R0" edc:desc="" edc:mask="0x1" edc:name="SS1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R1" edc:desc="" edc:mask="0x1" edc:name="SS1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R2" edc:desc="" edc:mask="0x1" edc:name="SS1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R3" edc:desc="" edc:mask="0x1" edc:name="SS1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS1R4" edc:desc="" edc:mask="0x1" edc:name="SS1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR0" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="RPOR0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP0R" edc:desc="" edc:mask="0x1f" edc:name="RP0R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R" edc:desc="" edc:mask="0x1f" edc:name="RP1R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP0R0" edc:desc="" edc:mask="0x1" edc:name="RP0R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R1" edc:desc="" edc:mask="0x1" edc:name="RP0R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R2" edc:desc="" edc:mask="0x1" edc:name="RP0R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R3" edc:desc="" edc:mask="0x1" edc:name="RP0R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP0R4" edc:desc="" edc:mask="0x1" edc:name="RP0R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP1R0" edc:desc="" edc:mask="0x1" edc:name="RP1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R1" edc:desc="" edc:mask="0x1" edc:name="RP1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R2" edc:desc="" edc:mask="0x1" edc:name="RP1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R3" edc:desc="" edc:mask="0x1" edc:name="RP1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP1R4" edc:desc="" edc:mask="0x1" edc:name="RP1R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-----------nnnnn" edc:cname="RPOR2" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000" edc:name="RPOR2" edc:nzwidth="0x10" edc:por="-----------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP4R" edc:desc="" edc:mask="0x1f" edc:name="RP4R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP4R0" edc:desc="" edc:mask="0x1" edc:name="RP4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R1" edc:desc="" edc:mask="0x1" edc:name="RP4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R2" edc:desc="" edc:mask="0x1" edc:name="RP4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R3" edc:desc="" edc:mask="0x1" edc:name="RP4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP4R4" edc:desc="" edc:mask="0x1" edc:name="RP4R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn--------" edc:cname="RPOR3" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000--------" edc:name="RPOR3" edc:nzwidth="0x10" edc:por="---00000--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP7R" edc:desc="" edc:mask="0x1f" edc:name="RP7R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="RP7R0" edc:desc="" edc:mask="0x1" edc:name="RP7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R1" edc:desc="" edc:mask="0x1" edc:name="RP7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R2" edc:desc="" edc:mask="0x1" edc:name="RP7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R3" edc:desc="" edc:mask="0x1" edc:name="RP7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7R4" edc:desc="" edc:mask="0x1" edc:name="RP7R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR4" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP8R" edc:desc="" edc:mask="0x1f" edc:name="RP8R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R" edc:desc="" edc:mask="0x1f" edc:name="RP9R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP8R0" edc:desc="" edc:mask="0x1" edc:name="RP8R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R1" edc:desc="" edc:mask="0x1" edc:name="RP8R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R2" edc:desc="" edc:mask="0x1" edc:name="RP8R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R3" edc:desc="" edc:mask="0x1" edc:name="RP8R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8R4" edc:desc="" edc:mask="0x1" edc:name="RP8R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP9R0" edc:desc="" edc:mask="0x1" edc:name="RP9R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R1" edc:desc="" edc:mask="0x1" edc:name="RP9R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R2" edc:desc="" edc:mask="0x1" edc:name="RP9R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R3" edc:desc="" edc:mask="0x1" edc:name="RP9R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP9R4" edc:desc="" edc:mask="0x1" edc:name="RP9R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---nnnnn---nnnnn" edc:cname="RPOR6" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000" edc:name="RPOR6" edc:nzwidth="0x10" edc:por="---00000---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x1f" edc:name="RP12R" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x1f" edc:name="RP13R" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP12R0" edc:desc="" edc:mask="0x1" edc:name="RP12R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R1" edc:desc="" edc:mask="0x1" edc:name="RP12R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R2" edc:desc="" edc:mask="0x1" edc:name="RP12R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R3" edc:desc="" edc:mask="0x1" edc:name="RP12R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R4" edc:desc="" edc:mask="0x1" edc:name="RP12R4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RP13R0" edc:desc="" edc:mask="0x1" edc:name="RP13R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R1" edc:desc="" edc:mask="0x1" edc:name="RP13R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R2" edc:desc="" edc:mask="0x1" edc:name="RP13R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R3" edc:desc="" edc:mask="0x1" edc:name="RP13R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R4" edc:desc="" edc:mask="0x1" edc:name="RP13R4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
